<template></template>

<script setup lang='ts'>
import { ref, reactive } from "vue";

// 切片上传 断点续传
console.log("----- 切片上传 -----");

// 一个上传组件需要具备的功能
// - 需要校验文件格式
// - 可以上传任何文件，包括超大的视频文件（切片）
// - 上传期间断网后，再次联网可以继续上传（断点续传）
// - 要有进度条提示
// - 已经上传过同一个文件后，直接上传完成（秒传）

// 前端部分要做的内容
// - 文件格式校验
// - 文件切片、md5计算
// - 发起检查请求，把当前文件的hash发送给服务端，检查是否有相同hash的文件
// - 上传进度计算
// - 上传完成后通知后端合并切片

// 后端部分要做的内容
// - 检查接收到的hash是否有相同的文件，并通知前端当前hash是否有未完成的上传
// - 接收切片
// - 合并所有切片

// 文件的二进制标识
// - JPEG/JPG - 文件头标识（2 bytes）：ff, d8 文件结束标识（2 bytes）：ff, d9
// - TGA - 未压缩的前5字节 00 00 02 00 00 - RLE 压缩前5字节 00 00 10 00 00
// - PNG - 文件头标识（8 bytes）89 40 4E 47 0D 0A 1A 0A
// - GIF - 文件头标识（6 bytes）47 49 46 38 39(37) 61
// - BMP - 文件头标识（2 bytes）42 4D B M
// - PCX - 文件头标识（1 bytes）0A
// - TIFF - 文件头标识（2 bytes）4D 4D 或 49 49
// - ICO - 文件头标识（8 bytes）00 00 01 00 01 00 20 20
// - IFF - 文件头标识（4 bytes）46 4F 52 4D
// - ANI - 文件头标识（4 bytes） 52 49 46 46
</script>

<style scoped>
</style>